fiotest/fio-write-ext7.txt
Creating filesystem with 33030144 4k blocks and 8257536 inodes
Filesystem UUID: 2de19613-112b-4e37-b777-d969c7f61250
Superblock backups stored on blocks: 
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208, 
	4096000, 7962624, 11239424, 20480000, 23887872

Allocating group tables:    0/1008         done                            
Writing inode tables:    0/1008         done                            
Creating journal (32768 blocks): done
Writing superblocks and filesystem accounting information:    0/1008         done

write: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=sync, iodepth=1
fio-3.26-29-ga2aa
Starting 1 process
write: Laying out IO file (1 file / 500MiB)

write: (groupid=0, jobs=1): err= 0: pid=3746: Wed Apr 21 17:36:03 2021
  write: IOPS=20.5k, BW=641MiB/s (672MB/s)(6412MiB/10001msec); 0 zone resets
    clat (usec): min=36, max=171, avg=48.10, stdev= 8.97
     lat (usec): min=36, max=171, avg=48.28, stdev= 8.97
    clat percentiles (usec):
     |  1.00th=[   40],  5.00th=[   42], 10.00th=[   43], 20.00th=[   44],
     | 30.00th=[   45], 40.00th=[   46], 50.00th=[   47], 60.00th=[   48],
     | 70.00th=[   49], 80.00th=[   51], 90.00th=[   53], 95.00th=[   55],
     | 99.00th=[  114], 99.50th=[  122], 99.90th=[  131], 99.95th=[  135],
     | 99.99th=[  155]
   bw (  KiB/s): min=651328, max=669952, per=100.00%, avg=657189.05, stdev=3896.02, samples=19
   iops        : min=20354, max=20936, avg=20537.16, stdev=121.75, samples=19
  lat (usec)   : 50=77.23%, 100=21.58%, 250=1.18%
  cpu          : usr=1.12%, sys=98.64%, ctx=842, majf=0, minf=91
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,205195,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=641MiB/s (672MB/s), 641MiB/s-641MiB/s (672MB/s-672MB/s), io=6412MiB (6724MB), run=10001-10001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
Creating filesystem with 33030144 4k blocks and 8257536 inodes
Filesystem UUID: ba4d34e3-5446-42f5-8192-e4feb52f030e
Superblock backups stored on blocks: 
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208, 
	4096000, 7962624, 11239424, 20480000, 23887872

Allocating group tables:    0/1008         done                            
Writing inode tables:    0/1008         done                            
Creating journal (32768 blocks): done
Writing superblocks and filesystem accounting information:    0/1008         done

write: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=sync, iodepth=1
...
fio-3.26-29-ga2aa
Starting 2 processes
write: Laying out IO file (1 file / 500MiB)

write: (groupid=0, jobs=2): err= 0: pid=3791: Wed Apr 21 17:36:14 2021
  write: IOPS=21.0k, BW=656MiB/s (688MB/s)(6565MiB/10001msec); 0 zone resets
    clat (usec): min=13, max=1800.1k, avg=94.56, stdev=6152.89
     lat (usec): min=13, max=1800.1k, avg=94.72, stdev=6152.89
    clat percentiles (usec):
     |  1.00th=[   21],  5.00th=[   42], 10.00th=[   44], 20.00th=[   46],
     | 30.00th=[   47], 40.00th=[   48], 50.00th=[   49], 60.00th=[   50],
     | 70.00th=[   51], 80.00th=[   53], 90.00th=[   57], 95.00th=[   67],
     | 99.00th=[  115], 99.50th=[  123], 99.90th=[  135], 99.95th=[  163],
     | 99.99th=[64226]
   bw (  KiB/s): min=559744, max=1223680, per=100.00%, avg=698067.17, stdev=98376.44, samples=32
   iops        : min=17492, max=38240, avg=21814.49, stdev=3074.25, samples=32
  lat (usec)   : 20=0.94%, 50=62.61%, 100=35.29%, 250=1.14%, 500=0.01%
  lat (msec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (msec)   : 250=0.01%, 500=0.01%, 750=0.01%, 2000=0.01%
  cpu          : usr=0.82%, sys=55.14%, ctx=191569, majf=0, minf=112
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,210064,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=656MiB/s (688MB/s), 656MiB/s-656MiB/s (688MB/s-688MB/s), io=6565MiB (6883MB), run=10001-10001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
Creating filesystem with 33030144 4k blocks and 8257536 inodes
Filesystem UUID: 9220f6d2-f56e-4627-988b-e4da24dc2808
Superblock backups stored on blocks: 
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208, 
	4096000, 7962624, 11239424, 20480000, 23887872

Allocating group tables:    0/1008         done                            
Writing inode tables:    0/1008         done                            
Creating journal (32768 blocks): done
Writing superblocks and filesystem accounting information:    0/1008         done

write: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=sync, iodepth=1
...
fio-3.26-29-ga2aa
Starting 4 processes
write: Laying out IO file (1 file / 500MiB)

write: (groupid=0, jobs=4): err= 0: pid=3837: Wed Apr 21 17:36:26 2021
  write: IOPS=30.7k, BW=960MiB/s (1006MB/s)(9600MiB/10001msec); 0 zone resets
    clat (usec): min=14, max=1808.1k, avg=129.39, stdev=7516.27
     lat (usec): min=14, max=1808.1k, avg=129.63, stdev=7516.28
    clat percentiles (usec):
     |  1.00th=[    19],  5.00th=[    20], 10.00th=[    21], 20.00th=[    24],
     | 30.00th=[    37], 40.00th=[    39], 50.00th=[    42], 60.00th=[    45],
     | 70.00th=[    48], 80.00th=[    51], 90.00th=[    55], 95.00th=[    63],
     | 99.00th=[   103], 99.50th=[   119], 99.90th=[   172], 99.95th=[ 32113],
     | 99.99th=[152044]
   bw (  MiB/s): min=   13, max= 2672, per=100.00%, avg=1169.82, stdev=204.78, samples=63
   iops        : min=  428, max=85510, avg=37434.21, stdev=6552.98, samples=63
  lat (usec)   : 20=6.10%, 50=71.99%, 100=20.72%, 250=1.11%, 500=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.03%, 100=0.02%, 250=0.01%
  lat (msec)   : 500=0.01%, 750=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=0.64%, sys=34.19%, ctx=308317, majf=0, minf=200
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,307184,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=960MiB/s (1006MB/s), 960MiB/s-960MiB/s (1006MB/s-1006MB/s), io=9600MiB (10.1GB), run=10001-10001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
Creating filesystem with 33030144 4k blocks and 8257536 inodes
Filesystem UUID: d4504d67-32f9-443e-a982-f5a9a6a07f1a
Superblock backups stored on blocks: 
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208, 
	4096000, 7962624, 11239424, 20480000, 23887872

Allocating group tables:    0/1008         done                            
Writing inode tables:    0/1008         done                            
Creating journal (32768 blocks): done
Writing superblocks and filesystem accounting information:    0/1008         done

write: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=sync, iodepth=1
...
fio-3.26-29-ga2aa
Starting 6 processes
write: Laying out IO file (1 file / 500MiB)

write: (groupid=0, jobs=6): err= 0: pid=3885: Wed Apr 21 17:36:37 2021
  write: IOPS=22.4k, BW=699MiB/s (733MB/s)(6988MiB/10001msec); 0 zone resets
    clat (usec): min=15, max=976100, avg=267.48, stdev=8008.42
     lat (usec): min=15, max=976101, avg=267.72, stdev=8008.42
    clat percentiles (usec):
     |  1.00th=[    21],  5.00th=[    36], 10.00th=[    40], 20.00th=[    44],
     | 30.00th=[    46], 40.00th=[    48], 50.00th=[    50], 60.00th=[    51],
     | 70.00th=[    55], 80.00th=[    89], 90.00th=[    95], 95.00th=[    99],
     | 99.00th=[   118], 99.50th=[   153], 99.90th=[ 60031], 99.95th=[143655],
     | 99.99th=[379585]
   bw (  KiB/s): min=25552, max=2686129, per=100.00%, avg=748902.34, stdev=132665.75, samples=107
   iops        : min=  798, max=83941, avg=23402.31, stdev=4145.77, samples=107
  lat (usec)   : 20=0.99%, 50=53.61%, 100=41.05%, 250=4.17%, 500=0.05%
  lat (msec)   : 20=0.01%, 50=0.02%, 100=0.04%, 250=0.04%, 500=0.02%
  lat (msec)   : 750=0.01%, 1000=0.01%
  cpu          : usr=0.36%, sys=23.13%, ctx=224948, majf=0, minf=230
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,223618,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=699MiB/s (733MB/s), 699MiB/s-699MiB/s (733MB/s-733MB/s), io=6988MiB (7328MB), run=10001-10001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
Creating filesystem with 33030144 4k blocks and 8257536 inodes
Filesystem UUID: 12765771-11ba-4554-bfae-ac40cb3742a3
Superblock backups stored on blocks: 
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208, 
	4096000, 7962624, 11239424, 20480000, 23887872

Allocating group tables:    0/1008         done                            
Writing inode tables:    0/1008         done                            
Creating journal (32768 blocks): done
Writing superblocks and filesystem accounting information:    0/1008         done

write: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=sync, iodepth=1
...
fio-3.26-29-ga2aa
Starting 8 processes
write: Laying out IO file (1 file / 500MiB)

write: (groupid=0, jobs=8): err= 0: pid=3935: Wed Apr 21 17:36:49 2021
  write: IOPS=19.9k, BW=623MiB/s (653MB/s)(6230MiB/10001msec); 0 zone resets
    clat (usec): min=17, max=3196.1k, avg=400.52, stdev=19638.99
     lat (usec): min=17, max=3196.1k, avg=400.74, stdev=19638.99
    clat percentiles (usec):
     |  1.00th=[    37],  5.00th=[    44], 10.00th=[    46], 20.00th=[    47],
     | 30.00th=[    49], 40.00th=[    50], 50.00th=[    51], 60.00th=[    53],
     | 70.00th=[    57], 80.00th=[    86], 90.00th=[    97], 95.00th=[   102],
     | 99.00th=[   126], 99.50th=[   141], 99.90th=[ 71828], 99.95th=[187696],
     | 99.99th=[501220]
   bw (  KiB/s): min=19968, max=3309696, per=100.00%, avg=826306.14, stdev=153007.54, samples=111
   iops        : min=  624, max=103428, avg=25821.94, stdev=4781.49, samples=111
  lat (usec)   : 20=0.05%, 50=42.54%, 100=51.23%, 250=5.95%, 500=0.11%
  lat (msec)   : 10=0.01%, 50=0.01%, 100=0.03%, 250=0.05%, 500=0.02%
  lat (msec)   : 750=0.01%, >=2000=0.01%
  cpu          : usr=0.25%, sys=16.05%, ctx=200395, majf=0, minf=274
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,199347,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=623MiB/s (653MB/s), 623MiB/s-623MiB/s (653MB/s-653MB/s), io=6230MiB (6532MB), run=10001-10001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
Creating filesystem with 33030144 4k blocks and 8257536 inodes
Filesystem UUID: 34b023ed-225e-4501-9d9c-4f87e65d652d
Superblock backups stored on blocks: 
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208, 
	4096000, 7962624, 11239424, 20480000, 23887872

Allocating group tables:    0/1008         done                            
Writing inode tables:    0/1008         done                            
Creating journal (32768 blocks): done
Writing superblocks and filesystem accounting information:    0/1008         done

write: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=sync, iodepth=1
...
fio-3.26-29-ga2aa
Starting 10 processes
write: Laying out IO file (1 file / 500MiB)

write: (groupid=0, jobs=10): err= 0: pid=3987: Wed Apr 21 17:37:00 2021
  write: IOPS=36.7k, BW=1148MiB/s (1203MB/s)(11.2GiB/10001msec); 0 zone resets
    clat (usec): min=14, max=724111, avg=271.42, stdev=8017.71
     lat (usec): min=14, max=724112, avg=271.67, stdev=8017.72
    clat percentiles (usec):
     |  1.00th=[    18],  5.00th=[    20], 10.00th=[    21], 20.00th=[    23],
     | 30.00th=[    26], 40.00th=[    37], 50.00th=[    39], 60.00th=[    41],
     | 70.00th=[    43], 80.00th=[    48], 90.00th=[    53], 95.00th=[    87],
     | 99.00th=[   103], 99.50th=[   115], 99.90th=[ 95945], 99.95th=[208667],
     | 99.99th=[346031]
   bw (  MiB/s): min=   44, max= 4147, per=100.00%, avg=1198.62, stdev=115.37, samples=187
   iops        : min= 1414, max=132732, avg=38355.93, stdev=3691.87, samples=187
  lat (usec)   : 20=9.28%, 50=76.26%, 100=12.91%, 250=1.44%, 500=0.01%
  lat (usec)   : 750=0.01%
  lat (msec)   : 50=0.01%, 100=0.01%, 250=0.07%, 500=0.03%, 750=0.01%
  cpu          : usr=0.40%, sys=15.58%, ctx=368772, majf=0, minf=407
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,367269,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1148MiB/s (1203MB/s), 1148MiB/s-1148MiB/s (1203MB/s-1203MB/s), io=11.2GiB (12.0GB), run=10001-10001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
Creating filesystem with 33030144 4k blocks and 8257536 inodes
Filesystem UUID: ce55f0ff-1f7e-4009-854f-1d90a2c24fc3
Superblock backups stored on blocks: 
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208, 
	4096000, 7962624, 11239424, 20480000, 23887872

Allocating group tables:    0/1008         done                            
Writing inode tables:    0/1008         done                            
Creating journal (32768 blocks): done
Writing superblocks and filesystem accounting information:    0/1008         done

write: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=sync, iodepth=1
...
fio-3.26-29-ga2aa
Starting 12 processes
write: Laying out IO file (1 file / 500MiB)

write: (groupid=0, jobs=12): err= 0: pid=4041: Wed Apr 21 17:37:12 2021
  write: IOPS=21.6k, BW=673MiB/s (706MB/s)(6736MiB/10002msec); 0 zone resets
    clat (usec): min=15, max=1620.1k, avg=555.88, stdev=16142.12
     lat (usec): min=15, max=1620.1k, avg=556.13, stdev=16142.12
    clat percentiles (usec):
     |  1.00th=[    20],  5.00th=[    24], 10.00th=[    40], 20.00th=[    46],
     | 30.00th=[    48], 40.00th=[    49], 50.00th=[    51], 60.00th=[    54],
     | 70.00th=[    72], 80.00th=[    93], 90.00th=[    98], 95.00th=[   103],
     | 99.00th=[   125], 99.50th=[   210], 99.90th=[217056], 99.95th=[329253],
     | 99.99th=[742392]
   bw (  KiB/s): min=19392, max=4106624, per=100.00%, avg=778964.40, stdev=106185.69, samples=199
   iops        : min=  606, max=128330, avg=24342.64, stdev=3318.28, samples=199
  lat (usec)   : 20=1.53%, 50=43.47%, 100=47.63%, 250=7.09%, 500=0.06%
  lat (usec)   : 750=0.06%
  lat (msec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.06%, 500=0.07%
  lat (msec)   : 750=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=0.22%, sys=11.77%, ctx=216835, majf=0, minf=348
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,215550,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=673MiB/s (706MB/s), 673MiB/s-673MiB/s (706MB/s-706MB/s), io=6736MiB (7063MB), run=10002-10002msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
Creating filesystem with 33030144 4k blocks and 8257536 inodes
Filesystem UUID: 7520b073-31e4-435a-beb1-0278e994c2c4
Superblock backups stored on blocks: 
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208, 
	4096000, 7962624, 11239424, 20480000, 23887872

Allocating group tables:    0/1008         done                            
Writing inode tables:    0/1008         done                            
Creating journal (32768 blocks): done
Writing superblocks and filesystem accounting information:    0/1008         done

write: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=sync, iodepth=1
...
fio-3.26-29-ga2aa
Starting 16 processes
write: Laying out IO file (1 file / 500MiB)

write: (groupid=0, jobs=16): err= 0: pid=4097: Wed Apr 21 17:37:24 2021
  write: IOPS=19.7k, BW=616MiB/s (646MB/s)(6161MiB/10001msec); 0 zone resets
    clat (usec): min=37, max=1208.1k, avg=810.68, stdev=21015.74
     lat (usec): min=37, max=1208.1k, avg=810.92, stdev=21015.74
    clat percentiles (usec):
     |  1.00th=[    43],  5.00th=[    45], 10.00th=[    46], 20.00th=[    48],
     | 30.00th=[    49], 40.00th=[    51], 50.00th=[    52], 60.00th=[    56],
     | 70.00th=[    88], 80.00th=[    94], 90.00th=[    99], 95.00th=[   103],
     | 99.00th=[   127], 99.50th=[   235], 99.90th=[308282], 99.95th=[566232],
     | 99.99th=[884999]
   bw (  KiB/s): min=17408, max=4106304, per=100.00%, avg=755871.81, stdev=85085.13, samples=251
   iops        : min=  544, max=128322, avg=23620.99, stdev=2658.91, samples=251
  lat (usec)   : 50=38.49%, 100=52.96%, 250=8.27%, 500=0.09%, 750=0.01%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 50=0.01%, 100=0.01%, 250=0.04%, 500=0.06%, 750=0.03%
  lat (msec)   : 1000=0.02%, 2000=0.01%
  cpu          : usr=0.15%, sys=8.56%, ctx=198565, majf=0, minf=372
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,197163,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=616MiB/s (646MB/s), 616MiB/s-616MiB/s (646MB/s-646MB/s), io=6161MiB (6461MB), run=10001-10001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
Creating filesystem with 33030144 4k blocks and 8257536 inodes
Filesystem UUID: 914b9e3b-a8ee-40a5-92d7-db89252be0dd
Superblock backups stored on blocks: 
	32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632, 2654208, 
	4096000, 7962624, 11239424, 20480000, 23887872

Allocating group tables:    0/1008         done                            
Writing inode tables:    0/1008         done                            
Creating journal (32768 blocks): done
Writing superblocks and filesystem accounting information:    0/1008         done

write: (g=0): rw=randrw, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=sync, iodepth=1
...
fio-3.26-29-ga2aa
Starting 20 processes
write: Laying out IO file (1 file / 500MiB)

write: (groupid=0, jobs=20): err= 0: pid=4157: Wed Apr 21 17:37:35 2021
  write: IOPS=28.6k, BW=893MiB/s (937MB/s)(8945MiB/10012msec); 0 zone resets
    clat (usec): min=14, max=2252.0k, avg=698.29, stdev=26058.98
     lat (usec): min=15, max=2252.1k, avg=698.53, stdev=26058.98
    clat percentiles (usec):
     |  1.00th=[     19],  5.00th=[     20], 10.00th=[     22],
     | 20.00th=[     24], 30.00th=[     34], 40.00th=[     40],
     | 50.00th=[     44], 60.00th=[     47], 70.00th=[     50],
     | 80.00th=[     52], 90.00th=[     60], 95.00th=[     91],
     | 99.00th=[    120], 99.50th=[    129], 99.90th=[    408],
     | 99.95th=[ 566232], 99.99th=[1333789]
   bw (  MiB/s): min=   45, max= 6420, per=100.00%, avg=1394.11, stdev=115.58, samples=241
   iops        : min= 1448, max=205440, avg=44611.00, stdev=3698.55, samples=241
  lat (usec)   : 20=5.39%, 50=67.58%, 100=24.05%, 250=2.85%, 500=0.05%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (msec)   : 500=0.02%, 750=0.02%, 1000=0.02%, 2000=0.01%, >=2000=0.01%
  cpu          : usr=0.17%, sys=6.76%, ctx=287231, majf=0, minf=353
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,286239,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=893MiB/s (937MB/s), 893MiB/s-893MiB/s (937MB/s-937MB/s), io=8945MiB (9379MB), run=10012-10012msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
done.